The new version of the provider with the new version of Terraform works in Centos 8.

```
$ cat /etc/centos-release
CentOS Linux release 8.2.2004 (Core) 
```

This is what I got:
```
$ ./test.sh
Enter password for your ESXi server:
Initializing the backend...

Initializing provider plugins...
- Finding latest version of josenk/esxi...
- Installing josenk/esxi v1.7.1...
- Installed josenk/esxi v1.7.1 (self-signed, key ID A3C2BB2C490C3920)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/plugins/signing.html

The following providers do not have any version constraints in configuration,
so the latest version was installed.

To prevent automatic upgrades to new major versions that may contain breaking
changes, we recommend adding version constraints in a required_providers block
in your configuration, with the constraint strings suggested below.

* josenk/esxi: version = "~> 1.7.1"

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

                                                                                                                                              
If you ever set or change modules or backend configuration for Terraform,                                                                     
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.  
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.                    
                                                 
                          
------------------------------------------------------------------------
                                                          
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
                                                    
Terraform will perform the following actions:       
                                                    
  # esxi_guest.myvirtualmachine will be created
  + resource "esxi_guest" "myvirtualmachine" {
      + boot_disk_size         = "200"
      + boot_disk_type         = "thin"
      + disk_store             = "alldisks"
      + guest_name             = "myvirtualmachine"
      + guest_shutdown_timeout = (known after apply)
      + guest_startup_timeout  = (known after apply)                 
      + guestos                = "centos-64"
      + id                     = (known after apply)           
      + ip_address             = (known after apply)                          
      + memsize                = "8192"           
      + notes                  = (known after apply)
      + numvcpus               = "4"                                         
      + ovf_properties_timer   = (known after apply)
      + power                  = "off"
      + resource_pool_name     = (known after apply)                         
      + virthwver              = "13"                                         
    }                                                              

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```


Make sure you remove the old image of iactools before running this test.

docker rmi tribrhy/iactools:latest

I will add that to the test.sh script.

